Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [4]:
data = [4, 8, 15, 16, 23, 42]
df = pd.Series(data)
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
list_type = ["name", "email", "roll Number", 2,3,4,5,6, 54.8]

In [8]:
df1 = pd.Series(list_type)

In [9]:
print(df1)

0           name
1          email
2    roll Number
3              2
4              3
5              4
6              5
7              6
8           54.8
dtype: object

In [10]:
table = {"Name" : ["Alice", "Bob", "Claire"],
         "Age" : [23, 30 ,27],
         "Gender" : ["Female", "Male", "Female"] 
}

In [12]:
df2 = pd.Series(table)

In [16]:
print(df2)

Name        [Alice, Bob, Claire]
Age                 [23, 30, 27]
Gender    [Female, Male, Female]
dtype: object

What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns

A Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [17]:
import pandas as pd

# Create a Pandas Series from a list
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

# Print the Series
print(s)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [20]:
import pandas as pd

# Create a DataFrame with a single column using a Python list
data = [1000, 2000, 3000, 4000, 5000]
df3 = pd.DataFrame(data, columns=['Column1'])

# Print the DataFrame
print(df3)

   Column1
0     1000
1     2000
2     3000
3     4000
4     5000

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [22]:
data = [1000, 2000, 3000, 4000, 5000]
df4 = pd.DataFrame(data, columns=['Column1'])

In [23]:
df4.head(3)

   Column1
0     1000
1     2000
2     3000

In [24]:
df4.tail(2)

   Column1
3     4000
4     5000

In [25]:
type(df4)

pandas.core.frame.DataFrame

Which of the following is mutable in nature Series, DataFrame, Panel?

Boh are mutable

Create a DataFrame using multiple Series. Explain with an example.

In [30]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

In [35]:
df5 = pd.concat([courses, fees, discount], axis=1)

In [37]:
df5

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000